lvx/base/Catalogs/бит_НастройкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиОтчетов</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПараметровПроизвольныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_НастройкиОтчетов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
	СохраненнаяСхема	 	 = СхемаКомпоновкиДанных.Получить();
	СохраненныйВариантОтчета = ВариантОтчета.Получить();
	
	Если ТипЗнч(СохраненнаяСхема) <> Тип("СхемаКомпоновкиДанных") Тогда
		СохраненнаяСхема = Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КонецЕсли;
	НастройкиПоУмолчанию = СохраненнаяСхема.НастройкиПоУмолчанию;
	
	Если ТипЗнч(СохраненныйВариантОтчета) = Тип("Строка") Тогда
		Попытка
			СохраненныйВариантОтчета = ОбщегоНазначения.ЗначениеИзСтрокиXML(СохраненныйВариантОтчета);	
		Исключение
			СохраненныйВариантОтчета = НастройкиПоУмолчанию;
		КонецПопытки;
	Иначе
		СохраненныйВариантОтчета = НастройкиПоУмолчанию;	
	КонецЕсли;
	
	Справочники.бит_НастройкиОтчетов.ДобавитьФиксированныеПереметры(СохраненнаяСхема);
	Справочники.бит_НастройкиОтчетов.ДобавитьФиксированныеПереметры(СохраненныйВариантОтчета);
	
	СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СохраненнаяСхема, Новый СжатиеДанных(9));
	ВариантОтчета		  = Новый ХранилищеЗначения(ОбщегоНазначения.ЗначениеВСтрокуXML(СохраненныйВариантОтчета), 
													Новый СжатиеДанных(9));

КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
